webavs-web/src/test/resources/globaz/pavo/process/FICHIER TEST-701.1054_Paloba SA_1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-DB59C7CE11C1C2641B14183009870221220">
				<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/>
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference>
						<ds:X509Data>
							<ds:X509IssuerSerial>
								<ds:X509IssuerName>C=CH,O=Swissdec,OU=Swissdec Consumer Certificate Authority</ds:X509IssuerName>
								<ds:X509SerialNumber>3253031911319125590</ds:X509SerialNumber>
							</ds:X509IssuerSerial>
						</ds:X509Data>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>gzvjh51sPb07vt1HvHSywk2Cz4wDLLPG3M92p0hR6eZA0/UHyocSQ8WihdkiWFvJWgwB0unyuFgDxdfAJgzzMKXFCDTjBTrmwaaepUTYyJ119cXN+7t+w6XMlvjLjh8gv2eBJawsoD/EW09WF7fBMJ7QTgZbWWn91HlKQ7imdAE=</xenc:CipherValue>
				</xenc:CipherData>
				<xenc:ReferenceList>
					<xenc:DataReference URI="#ED-1369"/>
					<xenc:DataReference URI="#ED-1370"/>
				</xenc:ReferenceList>
			</xenc:EncryptedKey>
			<wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-DB59C7CE11C1C2641B14183009870191217">MIICJTCCAY6gAwIBAgIIMD/7Kmnj9rkwDQYJKoZIhvcNAQEFBQAwVTEzMDEGA1UECxMqU3dpc3NkZWMgVHJhbnNtaXR0ZXIgQ2VydGlmaWNhdGUgQXV0aG9yaXR5MREwDwYDVQQKEwhTd2lzc2RlYzELMAkGA1UEBhMCQ0gwHhcNMDYxMTA5MTcwNDE3WhcNMjYxMTA0MTY1MjAxWjA2MRQwEgYDVQQDEwtEaXN0cmlidXRvcjERMA8GA1UEChMIU3dpc3NkZWMxCzAJBgNVBAYTAkNIMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCIjoxxCWioc86dgeepscii8KDGlO3bKHyAfh8nESJkj8TeGZ1Q4SgD3TXkWNgHIqjbROFXaIbHdXhF099VrZ2WWuxwsieIrtcQrSfLTbRMDLYsTDzstS078ObnyLSdURQVdyEbqKJM+/Mp+7h3+gKZdiUjn+bQ9SGJiFI1bG4jZwIDAQABox0wGzAMBgNVHRMBAf8EAjAAMAsGA1UdDwQEAwIEkDANBgkqhkiG9w0BAQUFAAOBgQAGVt8au16mE2zALHfdWmVftxKgdvLjSF5z3p2uSjJo2VwTMXQsRVIFK297xuPJABryNmf2txatMnKpNtnm2CWvfFxDV4hCipxNpJWVQouIQyrj4mrUcFiVnXjy7364cJyr5uxp96GAWen8dx749riPK2XztGl0dMIzzPqJ2aRQ8A==</wsse:BinarySecurityToken>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-1368">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/>
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
					<ds:Reference URI="#TS-1366">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap"/>
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<ds:DigestValue>bsUBt8Nm4Wku+CrmC+/HwB6p0X4=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#id-1367">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/>
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<ds:DigestValue>G9msfkTopw952zvez3BcH6T15VM=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>AVu9nMfjlfJXX1fyaD7/dMVSYYEwRX/YwFfpgU8OtfnlWBTnvIZNf9VVZ2W0hpVpJ9SYGHZy8Fk6
3otXRl9WL0tZpn7pEWOb2cW3vQJPTbsgF3iE/4bsYoGWlKYqtWWE+Ct7BBAyjl9ny8XSrcp4Y+EM
KOmTR7KrDsc8J0VsEbY=</ds:SignatureValue>
				<ds:KeyInfo Id="KI-DB59C7CE11C1C2641B14183009870191218">
					<wsse:SecurityTokenReference wsu:Id="STR-DB59C7CE11C1C2641B14183009870191219">
						<wsse:Reference URI="#X509-DB59C7CE11C1C2641B14183009870191217" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
			<wsu:Timestamp wsu:Id="TS-1366">
				<wsu:Created>2014-12-11T12:29:47.019Z</wsu:Created>
				<wsu:Expires>2014-12-11T12:44:47.019Z</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
	</soap:Header>
	<soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1367">
		<ns4:DeclareSalaryConsumer xmlns="http://www.swissdec.ch/schema/sd/20130514/SalaryDeclarationConsumerContainer" xmlns:ns2="http://www.swissdec.ch/schema/sd/20130514/SalaryDeclaration" xmlns:ns3="http://www.swissdec.ch/schema/sd/20130514/SalaryDeclarationContainer" xmlns:ns4="http://www.swissdec.ch/schema/sd/20130514/SalaryDeclarationConsumerServiceTypes">
			<DistributorRequestContext>
				<UserAgent>
					<Producer>swissdec</Producer>
					<Name>swissdec distributor</Name>
					<Version>3.3.10 (19943) 04.12.2014 17:18:29</Version>
				</UserAgent>
				<TransmissionDate>2014-12-11T13:29:46.931+01:00</TransmissionDate>
				<DeclarationID>14a3953959036f</DeclarationID>
				<DistributorRequestID>D14a395396332f1</DistributorRequestID>
				<TestCase/>
				<VersionMappingFrom>
					<WSDLNamespace>http://www.swissdec.ch/schema/sd/20090803/SalaryDeclarationService</WSDLNamespace>
					<ServiceTypesNamespace>http://www.swissdec.ch/schema/sd/20090803/SalaryDeclarationServiceTypes</ServiceTypesNamespace>
					<SalaryDeclarationMinorVersion>0.0</SalaryDeclarationMinorVersion>
				</VersionMappingFrom>
				<ProducerSecurityTokens>
					<Timestamp>2014-12-11T13:29:44.426+01:00</Timestamp>
					<X509Certificate>
						<Usage>Signature</Usage>
						<DistinguishedNameOwner>C=CH, L=Le Mont-sur-Lausanne, O=Micro Consulting SA, CN=Office Maker Staff, UID=3.0</DistinguishedNameOwner>
						<DistinguishedNameIssuer>C=CH, O=Swissdec, OU=Swissdec Transmitter Certificate Authority</DistinguishedNameIssuer>
						<SecuredElement>{http://schemas.xmlsoap.org/soap/envelope/}Body</SecuredElement>
						<SecuredElement>{http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd}Timestamp</SecuredElement>
					</X509Certificate>
					<X509Certificate>
						<Usage>Encryption</Usage>
						<DistinguishedNameOwner>C=CH, O=Swissdec, CN=Distributor</DistinguishedNameOwner>
						<DistinguishedNameIssuer>C=CH, O=Swissdec, OU=Swissdec Transmitter Certificate Authority</DistinguishedNameIssuer>
						<SecuredElement>{http://schemas.xmlsoap.org/soap/envelope/}Body</SecuredElement>
					</X509Certificate>
				</ProducerSecurityTokens>
				<ProducerResponseNotifications/>
				<Institutions>
					<ns2:AHV-AVS institutionID="#10009">
						<ns2:AK-CC-BranchNumber>150.000</ns2:AK-CC-BranchNumber>
						<ns2:AK-CC-CustomerNumber>701.1054</ns2:AK-CC-CustomerNumber>
					</ns2:AHV-AVS>
				</Institutions>
			</DistributorRequestContext>
			<DeclareSalary>
				<ns3:RequestContext>
					<ns3:UserAgent>
						<ns3:Producer>Micro Consulting SA</ns3:Producer>
						<ns3:Name>Office Maker Staff</ns3:Name>
						<ns3:Version>5.2</ns3:Version>
						<ns3:Certificate>1099.13</ns3:Certificate>
						<ns3:ELM-SalaryStandardVersion>3</ns3:ELM-SalaryStandardVersion>
					</ns3:UserAgent>
					<ns3:CompanyName>
						<ns2:HR-RC-Name>FICHIER TEST - Paloba SA</ns2:HR-RC-Name>
					</ns3:CompanyName>
					<ns3:TransmissionDate>2014-12-11T13:29:43.059+01:00</ns3:TransmissionDate>
					<ns3:RequestID>7d75c63f-918d-4b61-b917-c4094fbf32dc</ns3:RequestID>
					<ns3:LanguageCode>fr</ns3:LanguageCode>
					<ns3:TestCase/>
					<ns3:MonitoringID>officemaker</ns3:MonitoringID>
				</ns3:RequestContext>
				<ns3:Job>
					<ns3:Addressees>
						<ns3:AHV-AVS institutionIDRef="#10009">
							<ns3:ProcessByDistributor>true</ns3:ProcessByDistributor>
						</ns3:AHV-AVS>
					</ns3:Addressees>
				</ns3:Job>
				<ns3:SalaryDeclaration schemaVersion="0.0">
					<ns2:Company>
						<ns2:CompanyDescription>
							<ns2:Name>
								<ns2:HR-RC-Name>FICHIER TEST - Paloba SA</ns2:HR-RC-Name>
							</ns2:Name>
							<ns2:Owner>
								<ns2:Firstname>Marguerite</ns2:Firstname>
								<ns2:Lastname>Dupré</ns2:Lastname>
							</ns2:Owner>
							<ns2:Address>
								<ns2:ZIP-Code>1002</ns2:ZIP-Code>
								<ns2:City>Lausanne</ns2:City>
								<ns2:Country>CH</ns2:Country>
							</ns2:Address>
							<ns2:UID-EHRA>CH-100.3.032.254-8</ns2:UID-EHRA>
							<ns2:UID-BFS>CHE-999.999.996</ns2:UID-BFS>
							<ns2:Workplace workplaceID="#12345677">
								<ns2:BUR-REE-Number>12345677</ns2:BUR-REE-Number>
								<ns2:AddressExtended>
									<ns2:ZIP-Code>1002</ns2:ZIP-Code>
									<ns2:City>Lausanne</ns2:City>
								</ns2:AddressExtended>
								<ns2:CompanyWorkingTime>
									<ns2:WeeklyHoursAndLessons>
										<ns2:WeeklyHours>42.50</ns2:WeeklyHours>
										<ns2:WeeklyLessons>1</ns2:WeeklyLessons>
									</ns2:WeeklyHoursAndLessons>
								</ns2:CompanyWorkingTime>
							</ns2:Workplace>
							<ns2:Workplace workplaceID="#96321478">
								<ns2:BUR-REE-Number>96321478</ns2:BUR-REE-Number>
								<ns2:AddressExtended>
									<ns2:ZIP-Code>1200</ns2:ZIP-Code>
									<ns2:City>Genève</ns2:City>
								</ns2:AddressExtended>
								<ns2:CompanyWorkingTime>
									<ns2:WeeklyHoursAndLessons>
										<ns2:WeeklyHours>42.50</ns2:WeeklyHours>
										<ns2:WeeklyLessons>1</ns2:WeeklyLessons>
									</ns2:WeeklyHoursAndLessons>
								</ns2:CompanyWorkingTime>
							</ns2:Workplace>
						</ns2:CompanyDescription>
						<ns2:Staff>
							<ns2:Person>
								<ns2:Particulars>
									<ns2:Social-InsuranceIdentification>
										<ns2:SV-AS-Number>756.2102.3452.89</ns2:SV-AS-Number>
									</ns2:Social-InsuranceIdentification>
									<ns2:EmployeeNumber>AD</ns2:EmployeeNumber>
									<ns2:Lastname>Alladin</ns2:Lastname>
									<ns2:Firstname>Diane</ns2:Firstname>
									<ns2:Sex>F</ns2:Sex>
									<ns2:DateOfBirth>1973-08-11</ns2:DateOfBirth>
									<ns2:Nationality>CH</ns2:Nationality>
									<ns2:CivilStatus>
										<ns2:Status>married</ns2:Status>
									</ns2:CivilStatus>
									<ns2:Address>
										<ns2:Street>Rue de la Cure 2</ns2:Street>
										<ns2:ZIP-Code>1610</ns2:ZIP-Code>
										<ns2:City>Vuibroye</ns2:City>
									</ns2:Address>
									<ns2:ResidenceCanton>VD</ns2:ResidenceCanton>
								</ns2:Particulars>
								<ns2:Work>
									<ns2:WorkingTime>
										<ns2:WeeklyHours>42.00</ns2:WeeklyHours>
									</ns2:WorkingTime>
									<ns2:ActivityRate>100</ns2:ActivityRate>
									<ns2:EntryDate>1000-01-01</ns2:EntryDate>
									<ns2:LeaveEntitlement>25</ns2:LeaveEntitlement>
								</ns2:Work>
								<ns2:AHV-AVS-Salaries>
									<ns2:AHV-AVS-Salary institutionIDRef="#10009">
										<ns2:AccountingTime>
											<ns2:from>2014-01-01</ns2:from>
											<ns2:until>2014-12-31</ns2:until>
										</ns2:AccountingTime>
										<ns2:AHV-AVS-Income>50000.00</ns2:AHV-AVS-Income>
										<ns2:ALV-AC-Income>50000.00</ns2:ALV-AC-Income>
									</ns2:AHV-AVS-Salary>
								</ns2:AHV-AVS-Salaries>
							</ns2:Person>
							<ns2:Person>
								<ns2:Particulars>
									<ns2:Social-InsuranceIdentification>
										<ns2:SV-AS-Number>756.5759.1373.82</ns2:SV-AS-Number>
									</ns2:Social-InsuranceIdentification>
									<ns2:EmployeeNumber>BJ</ns2:EmployeeNumber>
									<ns2:Lastname>Barras</ns2:Lastname>
									<ns2:Firstname>Jacques</ns2:Firstname>
									<ns2:Sex>M</ns2:Sex>
									<ns2:DateOfBirth>1984-11-21</ns2:DateOfBirth>
									<ns2:Nationality>CH</ns2:Nationality>
									<ns2:CivilStatus>
										<ns2:Status>single</ns2:Status>
									</ns2:CivilStatus>
									<ns2:Address>
										<ns2:Street>Rue du Bois 23</ns2:Street>
										<ns2:ZIP-Code>1607</ns2:ZIP-Code>
										<ns2:City>Palézieux-Village</ns2:City>
									</ns2:Address>
									<ns2:ResidenceCanton>VD</ns2:ResidenceCanton>
								</ns2:Particulars>
								<ns2:Work>
									<ns2:WorkingTime>
										<ns2:WeeklyHours>42.00</ns2:WeeklyHours>
									</ns2:WorkingTime>
									<ns2:ActivityRate>100</ns2:ActivityRate>
									<ns2:EntryDate>1000-01-01</ns2:EntryDate>
								</ns2:Work>
								<ns2:AHV-AVS-Salaries>
									<ns2:AHV-AVS-Salary institutionIDRef="#10009">
										<ns2:AccountingTime>
											<ns2:from>2014-01-19</ns2:from>
											<ns2:until>2014-12-31</ns2:until>
										</ns2:AccountingTime>
										<ns2:AHV-AVS-Income>23052.60</ns2:AHV-AVS-Income>
										<ns2:ALV-AC-Income>23052.60</ns2:ALV-AC-Income>
									</ns2:AHV-AVS-Salary>
								</ns2:AHV-AVS-Salaries>
							</ns2:Person>
							<ns2:Person>
								<ns2:Particulars>
									<ns2:Social-InsuranceIdentification>
										<ns2:SV-AS-Number>756.1874.0249.34</ns2:SV-AS-Number>
									</ns2:Social-InsuranceIdentification>
									<ns2:EmployeeNumber>CJ</ns2:EmployeeNumber>
									<ns2:Lastname>Cardin</ns2:Lastname>
									<ns2:Firstname>Jean-Claude</ns2:Firstname>
									<ns2:Sex>M</ns2:Sex>
									<ns2:DateOfBirth>1965-01-16</ns2:DateOfBirth>
									<ns2:Nationality>FR</ns2:Nationality>
									<ns2:CivilStatus>
										<ns2:Status>married</ns2:Status>
									</ns2:CivilStatus>
									<ns2:Address>
										<ns2:Street>Place Saint François 22</ns2:Street>
										<ns2:ZIP-Code>1001</ns2:ZIP-Code>
										<ns2:City>Lausanne</ns2:City>
									</ns2:Address>
									<ns2:ResidenceCanton>VD</ns2:ResidenceCanton>
									<ns2:ResidenceCategory>settled-C</ns2:ResidenceCategory>
									<ns2:DegreeOfRelationship>unknown</ns2:DegreeOfRelationship>
								</ns2:Particulars>
								<ns2:Work>
									<ns2:WorkingTime>
										<ns2:WeeklyHours>42.00</ns2:WeeklyHours>
									</ns2:WorkingTime>
									<ns2:ActivityRate>100</ns2:ActivityRate>
									<ns2:EntryDate>1000-01-01</ns2:EntryDate>
									<ns2:LeaveEntitlement>25</ns2:LeaveEntitlement>
								</ns2:Work>
								<ns2:AHV-AVS-Salaries>
									<ns2:AHV-AVS-Salary institutionIDRef="#10009">
										<ns2:AccountingTime>
											<ns2:from>2014-01-01</ns2:from>
											<ns2:until>2014-12-31</ns2:until>
										</ns2:AccountingTime>
										<ns2:AHV-AVS-Income>42000.00</ns2:AHV-AVS-Income>
										<ns2:ALV-AC-Income>42000.00</ns2:ALV-AC-Income>
									</ns2:AHV-AVS-Salary>
								</ns2:AHV-AVS-Salaries>
							</ns2:Person>
							<ns2:Person>
								<ns2:Particulars>
									<ns2:Social-InsuranceIdentification>
										<ns2:SV-AS-Number>756.9649.9652.91</ns2:SV-AS-Number>
									</ns2:Social-InsuranceIdentification>
									<ns2:EmployeeNumber>NC</ns2:EmployeeNumber>
									<ns2:Lastname>Nadau</ns2:Lastname>
									<ns2:Firstname>Claire</ns2:Firstname>
									<ns2:Sex>F</ns2:Sex>
									<ns2:DateOfBirth>1981-04-22</ns2:DateOfBirth>
									<ns2:Nationality>FR</ns2:Nationality>
									<ns2:CivilStatus>
										<ns2:Status>single</ns2:Status>
									</ns2:CivilStatus>
									<ns2:Address>
										<ns2:Street>Place du Cirque</ns2:Street>
										<ns2:ZIP-Code>1009</ns2:ZIP-Code>
										<ns2:City>Pully</ns2:City>
									</ns2:Address>
									<ns2:ResidenceCanton>BE</ns2:ResidenceCanton>
									<ns2:ResidenceCategory>crossBorder-G</ns2:ResidenceCategory>
								</ns2:Particulars>
								<ns2:Work>
									<ns2:WorkingTime>
										<ns2:WeeklyHours>42.00</ns2:WeeklyHours>
									</ns2:WorkingTime>
									<ns2:ActivityRate>100</ns2:ActivityRate>
									<ns2:EntryDate>1000-01-01</ns2:EntryDate>
									<ns2:WithdrawalDate>2014-06-01</ns2:WithdrawalDate>
									<ns2:LeaveEntitlement>25</ns2:LeaveEntitlement>
								</ns2:Work>
								<ns2:AHV-AVS-Salaries>
									<ns2:AHV-AVS-Salary institutionIDRef="#10009">
										<ns2:AccountingTime>
											<ns2:from>2014-01-01</ns2:from>
											<ns2:until>2014-06-01</ns2:until>
										</ns2:AccountingTime>
										<ns2:AHV-AVS-Income>32848.25</ns2:AHV-AVS-Income>
										<ns2:ALV-AC-Income>32848.25</ns2:ALV-AC-Income>
									</ns2:AHV-AVS-Salary>
								</ns2:AHV-AVS-Salaries>
							</ns2:Person>
							<ns2:Person>
								<ns2:Particulars>
									<ns2:Social-InsuranceIdentification>
										<ns2:SV-AS-Number>756.9237.9847.34</ns2:SV-AS-Number>
									</ns2:Social-InsuranceIdentification>
									<ns2:EmployeeNumber>NEC</ns2:EmployeeNumber>
									<ns2:Lastname>Nevers</ns2:Lastname>
									<ns2:Firstname>Claude</ns2:Firstname>
									<ns2:Sex>M</ns2:Sex>
									<ns2:DateOfBirth>1979-05-04</ns2:DateOfBirth>
									<ns2:Nationality>CH</ns2:Nationality>
									<ns2:CivilStatus>
										<ns2:Status>married</ns2:Status>
									</ns2:CivilStatus>
									<ns2:Address>
										<ns2:Street>Rue des Finettes 4</ns2:Street>
										<ns2:ZIP-Code>1077</ns2:ZIP-Code>
										<ns2:City>Servion</ns2:City>
									</ns2:Address>
									<ns2:ResidenceCanton>VD</ns2:ResidenceCanton>
								</ns2:Particulars>
								<ns2:Work>
									<ns2:WorkingTime>
										<ns2:WeeklyHours>42.00</ns2:WeeklyHours>
									</ns2:WorkingTime>
									<ns2:ActivityRate>100</ns2:ActivityRate>
									<ns2:EntryDate>1000-01-01</ns2:EntryDate>
									<ns2:LeaveEntitlement>25</ns2:LeaveEntitlement>
								</ns2:Work>
								<ns2:AHV-AVS-Salaries>
									<ns2:AHV-AVS-Salary institutionIDRef="#10009">
										<ns2:AccountingTime>
											<ns2:from>2014-01-01</ns2:from>
											<ns2:until>2014-12-31</ns2:until>
										</ns2:AccountingTime>
										<ns2:AHV-AVS-Income>33142.85</ns2:AHV-AVS-Income>
										<ns2:ALV-AC-Income>33142.85</ns2:ALV-AC-Income>
									</ns2:AHV-AVS-Salary>
								</ns2:AHV-AVS-Salaries>
							</ns2:Person>
						</ns2:Staff>
						<ns2:Institutions>
							<ns2:AHV-AVS institutionID="#10009">
								<ns2:AK-CC-BranchNumber>150.000</ns2:AK-CC-BranchNumber>
								<ns2:AK-CC-CustomerNumber>701.1054</ns2:AK-CC-CustomerNumber>
							</ns2:AHV-AVS>
						</ns2:Institutions>
						<ns2:SalaryTotals>
							<ns2:AHV-AVS-Totals institutionIDRef="#10009">
								<ns2:Total-AHV-AVS-Incomes>181043.70</ns2:Total-AHV-AVS-Incomes>
								<ns2:Total-AHV-AVS-Open>0.00</ns2:Total-AHV-AVS-Open>
								<ns2:Total-ALV-AC-Incomes>181043.70</ns2:Total-ALV-AC-Incomes>
								<ns2:Total-ALVZ-ACS-Incomes>0.00</ns2:Total-ALVZ-ACS-Incomes>
								<ns2:Total-ALV-AC-Open>0.00</ns2:Total-ALV-AC-Open>
							</ns2:AHV-AVS-Totals>
						</ns2:SalaryTotals>
						<ns2:SalaryCounters>
							<ns2:NumberOf-AHV-AVS-Salary-Tags>5</ns2:NumberOf-AHV-AVS-Salary-Tags>
						</ns2:SalaryCounters>
					</ns2:Company>
					<ns2:GeneralSalaryDeclarationDescription>
						<ns2:CreationDate>2014-12-11T13:29:35</ns2:CreationDate>
						<ns2:AccountingPeriod>2014</ns2:AccountingPeriod>
						<ns2:ContactPerson>
							<ns2:Name>Dupré Marguerite</ns2:Name>
							<ns2:PhoneNumber>+41 21 651 77 66</ns2:PhoneNumber>
						</ns2:ContactPerson>
					</ns2:GeneralSalaryDeclarationDescription>
				</ns3:SalaryDeclaration>
			</DeclareSalary>
		</ns4:DeclareSalaryConsumer>
	</soap:Body>
</soap:Envelope>